# Задача 28
# Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел.
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.
# Пример:
# 2 2
# 4

a = int(input("Введите первое число (целое и неотрицательное): "))
b = int(input("Введите второе число (целое и неотрицательное): "))

def sum(a, b):
    if a == 0:
        return b
    else:
        return sum(a - 1, b + 1)

result = sum(a, b)
print(f'Сумма чисел {a} и {b} равна {result}')